<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>PayloadContent</key>
  <array>
    <dict>
      <key>PayloadCertificateFileName</key>
      <string>${CA_CERT_FILENAME}</string>
      <key>PayloadContent</key>
      <data>
      ${CA_CERT_BASE64}
      </data>
      <key>PayloadDescription</key>
      <string>Adds the internal CA root certificate to the device.</string>
      <key>PayloadDisplayName</key>
      <string>${CA_CERT_FILENAME}</string>
      <key>PayloadIdentifier</key>
      <string>com.${PORTAL_DOMAIN}.internalca</string>
      <key>PayloadType</key>
      <string>com.apple.security.root</string>
      <key>PayloadUUID</key>
      <string>$(uuidgen)</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
    </dict>
  </array>
  <key>PayloadDisplayName</key>
  <string>${PORTAL_DOMAIN} - Internal CA</string>
  <key>PayloadIdentifier</key>
  <string>com.${PORTAL_DOMAIN}</string>
  <key>PayloadRemovalDisallowed</key>
  <false/>
  <key>PayloadType</key>
  <string>Configuration</string>
  <key>PayloadUUID</key>
  <string>$(uuidgen)</string>
  <key>PayloadVersion</key>
  <integer>1</integer>
</dict>
</plist>
